a = int(input("Введите число:  "))
sum = 0

while a > 0:
    b = a % 10
    sum = sum + b
    a = a//10

print(f"Сумма цифр числа = {sum}")

"""Найдите сумму цифр трехзначного числа."""
